//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2024, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

//*************************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------
//
// Name:    SB.UNI
//
// Description: South Bridge String definitions
//
//----------------------------------------------------------------------
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif
/// The last tag is "SB055"

//---------------------------------------------------------------------------
// Common use
//---------------------------------------------------------------------------
#string STR_AUTO                         #language eng "Auto"
#string STR_NONE                         #language eng "None"
#string STR_HELP                         #language eng ""
#string STR_ENABLE                       #language eng "Enabled"
#string STR_DISABLE                      #language eng "Disabled"
#string STR_OFF                          #language eng "Off"
#string STR_ON                           #language eng "On"
#string STR_VAL00                        #language eng "00"
#string STR_VAL01                        #language eng "01"
#string STR_VAL02                        #language eng "02"
#string STR_VAL03                        #language eng "03"
#string STR_VAL04                        #language eng "04"
#string STR_YES                          #language eng "Yes"
#string STR_NO                           #language eng "No"

//---#string XXXX #language eng "XXX"

//---------------------------------------------------------------------------
// South Bridge form Configuration
//---------------------------------------------------------------------------
#string STR_SB_FORM                      #language eng "South Bridge"
#string STR_SB_FORM                      #language fra "fra South Bridge"
#language x-AMI "SB001"
#string STR_SB_FORM_HELP                 #language eng "South Bridge Parameters"
#string STR_SB_FORM_HELP                 #language fra "fra South Bridge Parameters"
#string STR_AMD_REF_VER_STRING           #language eng "AMD Reference Code Version :"
#string STR_AMD_REF_VER_HELP             #language eng "xx"
#string STR_AMD_REF_VER                  #language eng "Not Present"

//----#string STR_AC97_PROMPT #language eng "AC97 Audio Device"
//----#string STR_MC97_PROMPT #language eng "MC97 Audio Device"

// USB
string STR_USB_ALL_ENABLE              #language eng "Enabled All Of USB Devices"
#language x-AMI "SB005"
#string STR_USB_ALL_ENABLE_HELP         #language eng "Enabled/Disabled All Of USB Devices"
#string STR_USBPORT_0_STRING            #language eng "USB Internal Port 0 "
#language x-AMI "SB006"
#string STR_USBPORT_0_HELP              #language eng "Enabled/Disabled USB Internal Port 0 "
#string STR_USBPORT_1_STRING            #language eng "USB Internal Port 1 "
#language x-AMI "SB007"
#string STR_USBPORT_1_HELP              #language eng "Enabled/Disabled USB Internal Port 1 "
#string STR_USBPORT_2_STRING            #language eng "USB Internal Port 2 "
#language x-AMI "SB008"
#string STR_USBPORT_2_HELP              #language eng "Enabled/Disabled USB Internal Port 2 "
#string STR_USBPORT_3_STRING            #language eng "USB Internal Port 3 "
#language x-AMI "SB009"
#string STR_USBPORT_3_HELP              #language eng "Enabled/Disabled USB Internal Port 3 "
#string STR_USBPORT_4_STRING            #language eng "USB Internal Port 4 "
#language x-AMI "SB00A"
#string STR_USBPORT_4_HELP              #language eng "Enabled/Disabled USB Internal Port 4 "
#string STR_USBPORT_5_STRING            #language eng "USB Internal Port 5 "
#language x-AMI "SB00B"
#string STR_USBPORT_5_HELP              #language eng "Enabled/Disabled USB Internal Port 5 "
#string STR_USBHUBPORT_0_STRING         #language eng "  HUB Port 0 "
#language x-AMI "SB050"
#string STR_USBHUBPORT_0_HELP           #language eng "Enabled/Disabled HUB Port 0 "
#string STR_USBHUBPORT_1_STRING         #language eng "  HUB Port 1 "
#language x-AMI "SB051"
#string STR_USBHUBPORT_1_HELP           #language eng "Enabled/Disabled HUB Port 1 "
#string STR_USBHUBPORT_2_STRING         #language eng "  HUB Port 2 "
#language x-AMI "SB052"
#string STR_USBHUBPORT_2_HELP           #language eng "Enabled/Disabled HUB Port 2 "
#string STR_USBHUBPORT_3_STRING         #language eng "  HUB Port 3 "
#language x-AMI "SB053"
#string STR_USBHUBPORT_3_HELP           #language eng "Enabled/Disabled HUB Port 3 "
#string STR_USBHUBPORT_4_STRING         #language eng "  HUB Port 4 "
#language x-AMI "SB054"
#string STR_USBHUBPORT_4_HELP           #language eng "Enabled/Disabled HUB Port 4 "
#string STR_USBHUBPORT_5_STRING         #language eng "  HUB Port 5 "
#language x-AMI "SB055"
#string STR_USBHUBPORT_5_HELP           #language eng "Enabled/Disabled HUB Port 5 "
#string STR_USBHUBPORT_6_STRING         #language eng "  HUB Port 6 "
#language x-AMI "SB00C"
#string STR_USBHUBPORT_6_HELP           #language eng "Enabled/Disabled HUB Port 6 "
#string STR_USBHUBPORT_7_STRING         #language eng "  HUB Port 7 "
#language x-AMI "SB00D"
#string STR_USBHUBPORT_7_HELP           #language eng "Enabled/Disabled HUB Port 7 "
#string STR_USBHUBPORT_8_STRING         #language eng "  HUB Port 8 "
#language x-AMI "SB00E"
#string STR_USBHUBPORT_8_HELP           #language eng "Enabled/Disabled HUB Port 8 "
#string STR_USBHUBPORT_9_STRING         #language eng "  HUB Port 9 "
#language x-AMI "SB00F"
#string STR_USBHUBPORT_9_HELP           #language eng "Enabled/Disabled HUB Port 9 "
#string STR_XHCI0PORT_0_STRING          #language eng "XHCI0 Port 0 "
#language x-AMI "SB00G"
#string STR_XHCI0PORT_0_HELP            #language eng "Enabled/Disabled XHCI0 Port 0 "
#string STR_XHCI0PORT_1_STRING          #language eng "XHCI0 Port 1 "
#language x-AMI "SB00H"
#string STR_XHCI0PORT_1_HELP            #language eng "Enabled/Disabled XHCI0 Port 1 "
//-----#string STR_USB1_OHCI0_PROMPT #language eng "xx"

// SATA
#string STR_SATA_PROMPT                 #language eng "OnChip SATA Channel"
#language x-AMI "SB00I"
#string STR_SATA_TYPE_PROMPT            #language eng "OnChip SATA Type"
#language x-AMI "SB00J"
#string STR_SATA_TYPE_HELP              #language eng "Native IDE /n RAID /n AHCI /n AHCI /n Legacy IDE /n IDE->AHCI /n HyperFlash"
#string STR_ENABLED_AS_IDE              #language eng "Native IDE"
#string STR_ENABLED_AS_AHCI             #language eng "AHCI"
#string STR_ENABLED_AS_IDE_LEGACY       #language eng "Legacy IDE"
#string STR_ENABLED_AS_AHCI_ID          #language eng "AHCI as ID 7804"
#string STR_SB_POWER_SAVINGS_PROMPT     #language eng "Chipset Power Saving Features"
#language x-AMI "SB00L"
#string STR_SB_POWER_SAVINGS_HELP       #language eng "Chipset Power Saving Features"

#string STR_SATA0_ESP                   #language eng "ESATA Port On Port 0"
#language x-AMI "SB00N"
#string STR_SATA1_ESP                   #language eng "ESATA Port On Port 1"
#language x-AMI "SB00O"
#string STR_SATA2_ESP                   #language eng "ESATA Port On Port 2"
#language x-AMI "SB00P"
#string STR_SATA3_ESP                   #language eng "ESATA Port On Port 3"
#language x-AMI "SB00Q"
#string STR_SATA4_ESP                   #language eng "ESATA Port On Port 4"
#language x-AMI "SB00R"
#string STR_SATA5_ESP                   #language eng "ESATA Port On Port 5"
#language x-AMI "SB00S"
#string STR_SATA6_ESP                   #language eng "ESATA Port On Port 6"
#language x-AMI "SB00T"
#string STR_SATA7_ESP                   #language eng "ESATA Port On Port 7"
#language x-AMI "SB00U"

#string STR_SATA0_POWER                 #language eng "SATA Power On Port 0"
#language x-AMI "SB00V"
#string STR_SATA1_POWER                 #language eng "SATA Power On Port 1"
#language x-AMI "SB00W"
#string STR_SATA2_POWER                 #language eng "SATA Power On Port 2"
#language x-AMI "SB00X"
#string STR_SATA3_POWER                 #language eng "SATA Power On Port 3"
#language x-AMI "SB00Y"
#string STR_SATA4_POWER                 #language eng "SATA Power On Port 4"
#language x-AMI "SB00Z"
#string STR_SATA5_POWER                 #language eng "SATA Power On Port 5"
#language x-AMI "SB010"
#string STR_SATA6_POWER                 #language eng "SATA Power On Port 6"
#language x-AMI "SB011"
#string STR_SATA7_POWER                 #language eng "SATA Power On Port 7"
#language x-AMI "SB012"

#string STR_SATA_POWERDOWN              #language eng "Power Down"

#string STR_HPET_EN_PROMPT              #language eng "HPET In SB"
#language x-AMI "SB01B"
#string STR_HPET_EN_HELP                #language eng "HPET Function Switch"
#string STR_OSC_EN_PROMPT               #language eng "_OSC For PCI0"
#language x-AMI "SB01C"
#string STR_OSC_EN_HELP                 #language eng "PCIe NativePcieSupport - Debug function."
#string STR_SB_POWER_STATE_PROMPT       #language eng "Restore On AC Power Loss"
#language x-AMI "SB01D"
#string STR_SB_POWER_STATE_HELP         #language eng "Restore Status On AC Power Loss"
#string STR_POWER_ON                    #language eng "Power On"
#string STR_POWER_OFF                   #language eng "Power Off"
#string STR_LAST_STATE                  #language eng "Last State"

// Power Saving
#string STR_AB_CLOCK_GATING_PROMPT      #language eng "AB Clock Gating"
#language x-AMI "SB01E"
#string STR_AB_CLOCK_GATING_HELP        #language eng "Enable/Disable AB Internal Clock Gating"

//---------------------------------------------------------------------------
// Sub form Configuration
//---------------------------------------------------------------------------
#string STR_HWM_CONFIG_FORM             #language eng "SB Hardware Monitor"
#language x-AMI "SB01G"
#string STR_HWM_CONFIG_FORM_HELP        #language eng "SB Hardware Monitor"
#string STR_SB_DEB_CONFIG_FORM          #language eng "SB Debug Configuration"
#language x-AMI "SB01H"
#string STR_SB_DEB_CONFIG_FORM_HELP     #language eng "Options For SB Debug Features"
#string STR_PS_CONFIG_FORM              #language eng "SB Power Saving"
#language x-AMI "SB01J"
#string STR_PS_CONFIG_FORM_HELP         #language eng "Options For SB Power Saving"

//---------------------------------------------------------------------------
// SB Debug form
//---------------------------------------------------------------------------
//#string STR_SPREAD_SPECTRUM_PROMPT      #language eng "SB Clock Spread Spectrum"
//#language x-AMI "SB01K"
//#string STR_SPREAD_SPECTRUM_HELP        #language eng "Enable/Disable CG1_PLL Spread Spectrum"
#string STR_SATA_AGGR_LINK_PM_CAP_PROMPT        #language eng "Aggressive Link PM Capability"
#language x-AMI "SB01M"
#string STR_SATA_AGGR_LINK_PM_CAP_HELP          #language eng "Indicates Whether Host Bus Adapter (HBA) Can Support Auto-Generating Link Requests To The Partial Or Slumber States When There Are No Commands To Process"
#string STR_SATA_PORT_MULT_CAP_PROMPT   #language eng "Port Multiplier Capability"
#language x-AMI "SB01N"
#string STR_SATA_PORT_MULT_CAP_HELP     #language eng "Indicates Whether Host Bus Adapter (HBA) Can Support A Port Multiplier"
#string STR_SATA_PSC_CAP_PROMPT         #language eng "SATA Partial State Capability"
#language x-AMI "SB01O"
#string STR_SATA_PSC_CAP_HELP           #language eng "Indicates Whether SATA Host Bus Adapter (HBA) Can Support Transitions To The Partial State"
#string STR_SATA_SSC_CAP_PROMPT         #language eng "SATA Slumber State Capability"
#language x-AMI "SB01P"
#string STR_SATA_SSC_CAP_HELP           #language eng "Indicates Whether SATA Host Bus Adapter (HBA) Can Support Transitions To The Slumber State"
#string STR_SATA_CCC_PROMPT             #language eng "SATA Command Completion Coalescing Support"
#language x-AMI "SB01Q"
#string STR_SATA_CCC_HELP               #language eng "Indicates Whether SATA Host Bus Adapter (HBA) Can Support Command Completion Coalescing"
#string STR_SATA_FIS_BASED_SWITCH_PROMPT        #language eng "SATA FIS Based Switching"
#language x-AMI "SB01S"
#string STR_SATA_FIS_BASED_SWITCH_HELP          #language eng "Indicates Whether SATA Host Bus Adapter (HBA) Can Support Port Multiplier FIS-Based Switching"

#string STR_SB_IR_CONFIG_PROMPT         #language eng "IR Config"
#language x-AMI "SB01T"
#string STR_SB_IR_CONFIG_HELP           #language eng "Infrared (IR) Configuration"
#string STR_RX_TX0_ONLY_TEXT            #language eng "RX & TX0 Only"
#string STR_RX_TX1_ONLY_TEXT            #language eng "RX & TX1 Only"
#string STR_RX_TX0_AND_TX1_TEXT         #language eng "RX, TX0, And TX1"

#string STR_SATA_AUTO_CLK_CONTROL_PROMPT        #language eng "SATA Ports Auto Clock Control"
#language x-AMI "SB01U"
#string STR_SATA_AUTO_CLK_CONTROL_HELP          #language eng "EnableDisable SATA Ports Auto Clock Control"
#string STR_EXTERNAL                    #language eng "External 48Mhz Clk"
#string STR_INTERNAL                    #language eng "Internal SB Clk"
#string STR_SATA_PORT0_MODE_PROMPT      #language eng "SATA Port 0 MODE"
#language x-AMI "SB01X"
#string STR_SATA_PORT0_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 0"
#string STR_SATA_PORT1_MODE_PROMPT      #language eng "SATA Port 1 MODE"
#language x-AMI "SB01Y"
#string STR_SATA_PORT1_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 1"
#string STR_SATA_PORT2_MODE_PROMPT      #language eng "SATA Port 2 MODE"
#language x-AMI "SB01Z"
#string STR_SATA_PORT2_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 2"
#string STR_SATA_PORT3_MODE_PROMPT      #language eng "SATA Port 3 MODE"
#language x-AMI "SB020"
#string STR_SATA_PORT3_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 3"
#string STR_SATA_PORT4_MODE_PROMPT      #language eng "SATA Port 4 MODE"
#language x-AMI "SB021"
#string STR_SATA_PORT4_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 4"
#string STR_SATA_PORT5_MODE_PROMPT      #language eng "SATA Port 5 MODE"
#language x-AMI "SB022"
#string STR_SATA_PORT5_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 5"
#string STR_SATA_PORT6_MODE_PROMPT      #language eng "SATA Port 6 MODE"
#language x-AMI "SB023"
#string STR_SATA_PORT6_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 6"
#string STR_SATA_PORT7_MODE_PROMPT      #language eng "SATA Port 7 MODE"
#language x-AMI "SB024"
#string STR_SATA_PORT7_MODE_HELP        #language eng "Indicates The Highest Allowable Speed Of The SATA Port 7"

#string STR_GEN1                        #language eng "GEN1"
#string STR_GEN2                        #language eng "GEN2"

#string STR_SB_LPC_MSI_PROMPT           #language eng "LPC MSI Option"
#language x-AMI "SB027"
#string STR_SB_LPC_MSI_HELP             #language eng "LPC MSI Capability"

        //
        // USB4
        //
#string STR_USB_XHCI0_PROMPT            #language eng "XHCI Controller 0"
#language x-AMI "SB02A"
#string STR_XHC_HELP                    #language eng "XHCI Enable Help"
//--#string STR_XXX #language eng "XXX"

//---------------------------------------------------------------------------
// IDE Configuration
//---------------------------------------------------------------------------
#string STR_IDE_CONFIG_FORM             #language eng "IDE Configuration"
#string STR_IDE_CONFIG_FORM             #language fra "fra IDE Configuration"
#language x-AMI "SB02B"
#string STR_IDE_CONFIG_FORM_HELP        #language eng "IDE Devices Configuration"
#string STR_IDE_CONFIG_FORM_HELP        #language fra "fra IDE Devices Configuration"
//--#string STR_IDE_MODE                    #language eng "IDE Mode"
//--#string STR_IDE_MODE                    #language fra "fra IDE Mode"
//--#string STR_IDE_MODE_HELP               #language eng "Enhanced(Native) / Combined (Legacy) Mode "
//--#string STR_IDE_MODE_HELP               #language fra "fra Enhanced(Native) / Combined (Legacy) Mode "
//--#string STR_IDE_NON_COMBINED            #language eng "Enhanced (Native) Mode "
//--#string STR_IDE_NON_COMBINED            #language fra "fra Enhanced (Native) Mode "
//--#string STR_IDE_COMBINED_PATA           #language eng "Combined (Legacy) Mode with PATA as Primary"
//--#string STR_IDE_COMBINED_PATA           #language fra "fra Combined (Legacy) Mode with PATA as Primary"
//--#string STR_IDE_COMBINED_SATA           #language eng "Combined (Legacy) Mode with SATA as Primary"
//--#string STR_IDE_COMBINED_SATA           #language fra "fra Combined (Legacy) Mode with SATA as Primary"

//--#string STR_SATA_PROMPT                 #language eng "Serial-ATA (SATA)"
//--#string STR_SATA_PROMPT                 #language fra "fra Serial-ATA (SATA)"
#string STR_SATA_PROMPT_HELP            #language eng "Enabled / Disabled Serial ATA"
#string STR_SATA_PROMPT_HELP            #language fra "fra Enabled / Disabled Serial ATA"
#string STR_SATA_IDE                    #language eng "IDE Mode"
#string STR_SATA_IDE                    #language fra "fra IDE Mode"
#string STR_SATA_AHCI                   #language eng "AHCI Mode"
#string STR_SATA_AHCI                   #language fra "fra AHCI Mode"
#string STR_SATA_HELP                   #language eng "SATA Ports (0-3) Device Names If Present And Enable."
#string STR_SATA_HELP                   #language fra "fra SATA Ports (0-3) Device Names If Present And Enable."
#string STR_SATA_0_STRING               #language eng "SATA Port0"
#string STR_SATA_0_STRING               #language fra "fra SATA Port 0"
#string STR_SATA_1_STRING               #language eng "SATA Port1"
#string STR_SATA_1_STRING               #language fra "fra SATA Port 1"
#string STR_SATA_2_STRING               #language eng "SATA Port2"
#string STR_SATA_2_STRING               #language fra "fra SATA Port 2"
#string STR_SATA_3_STRING               #language eng "SATA Port3"
#string STR_SATA_3_STRING               #language fra "fra SATA Port 3"
#string STR_SATA_4_STRING               #language eng "SATA Port4"
#string STR_SATA_4_STRING               #language fra "fra SATA Port 4"
#string STR_SATA_5_STRING               #language eng "SATA Port5"
#string STR_SATA_5_STRING               #language fra "fra SATA Port 5"
#string STR_SATA_6_STRING               #language eng "SATA Port6"
#string STR_SATA_6_STRING               #language fra "fra SATA Port 6"
#string STR_SATA_7_STRING               #language eng "SATA Port7"
#string STR_SATA_7_STRING               #language fra "fra SATA Port 7"
#string STR_SATA_0_NAME                 #language eng "Not Present"
#string STR_SATA_0_NAME                 #language fra "fra Not Present"
#string STR_SATA_1_NAME                 #language eng "Not Present"
#string STR_SATA_1_NAME                 #language fra "fra Not Present"
#string STR_SATA_2_NAME                 #language eng "Not Present"
#string STR_SATA_2_NAME                 #language fra "fra Not Present"
#string STR_SATA_3_NAME                 #language eng "Not Present"
#string STR_SATA_3_NAME                 #language fra "fra Not Present"
#string STR_SATA_4_NAME                 #language eng "Not Present"
#string STR_SATA_4_NAME                 #language fra "fra Not Present"
#string STR_SATA_5_NAME                 #language eng "Not Present"
#string STR_SATA_5_NAME                 #language fra "fra Not Present"
#string STR_SATA_6_NAME                 #language eng "Not Present"
#string STR_SATA_6_NAME                 #language fra "fra Not Present"
#string STR_SATA_7_NAME                 #language eng "Not Present"
#string STR_SATA_7_NAME                 #language fra "fra Not Present"

#string STR_PATA_MASTER_FORM            #language eng "PATA Master:     Not Present"
#language x-AMI "SB02C"
#string STR_PATA_MASTER_FORM_HELP       #language eng "PATA Master Status"
#string STR_PATA_SLAVE_FORM             #language eng "PATA Slave:      Not Present"
#language x-AMI "SB02D"
#string STR_PATA_SLAVE_FORM_HELP        #language eng "PATA Slave Status"
#string STR_SATA0_FORM                  #language eng "SATA Port 0:     Not Present"
#language x-AMI "SB02E"
#string STR_SATA0_FORM_HELP             #language eng "SATA Port Status"
#string STR_SATA1_FORM                  #language eng "SATA Port 1:     Not Present"
#language x-AMI "SB02F"
#string STR_SATA1_FORM_HELP             #language eng "SATA Port Status"
#string STR_SATA2_FORM                  #language eng "SATA Port 2:     Not Present"
#language x-AMI "SB02G"
#string STR_SATA2_FORM_HELP             #language eng "SATA Port Status"
#string STR_SATA3_FORM                  #language eng "SATA Port 3:     Not Present"
#language x-AMI "SB02H"
#string STR_SATA3_FORM_HELP             #language eng "SATA Port Status"
#string STR_SATA4_FORM                  #language eng "SATA Port 4:     Not Present"
#language x-AMI "SB02I"
#string STR_SATA4_FORM_HELP             #language eng "SATA Port Status"
#string STR_SATA5_FORM                  #language eng "SATA Port 5:     Not Present"
#language x-AMI "SB02J"
#string STR_SATA5_FORM_HELP             #language eng "SATA Port Status"

#string STR_PIO_MODE_PROMPT             #language eng "PIO Mode"
#language x-AMI "SB02K"
#string STR_PIO_MODE_HELP               #language eng "Programmed Input/Output Mode"
#string STR_DMA_MODE_PROMPT             #language eng "DMA Mode"
#language x-AMI "SB02L"
#string STR_DMA_MODE_HELP               #language eng "Direct Memory Access Mode"
#string STR_SWDMA0                      #language eng "SWDMA0"
#string STR_SWDMA1                      #language eng "SWDMA1"
#string STR_SWDMA2                      #language eng "SWDMA2"
#string STR_MWDMA0                      #language eng "MWDMA0"
#string STR_MWDMA1                      #language eng "MWDMA1"
#string STR_MWDMA2                      #language eng "MWDMA2"
#string STR_UDMA0                       #language eng "UDMA0"
#string STR_UDMA1                       #language eng "UDMA1"
#string STR_UDMA2                       #language eng "UDMA2"
#string STR_UDMA3                       #language eng "UDMA3"
#string STR_UDMA4                       #language eng "UDMA4"
#string STR_UDMA5                       #language eng "UDMA5"
#string STR_UDMA6                       #language eng "UDMA6"
//---------------------------------------------------------------------------
//Chipset-> South Bridge-> GPP Configuration
//---------------------------------------------------------------------------
#string STR_SATA_CONFIG_FORM            #language eng "SB SATA Configuration"
#language x-AMI "SB02M"
#string STR_SATA_CONFIG_FORM_HELP       #language eng "Options For SATA Configuration"

#string STR_USB_CONFIG_FORM             #language eng "SB USB Configuration"
#language x-AMI "SB02N"
#string STR_USB_CONFIG_FORM_HELP        #language eng "Options For SB USB Configuration"

#string STR_MISC_DEBUG_CONFIG_FORM      #language eng "SB MISC DEBUG Configuration"
#language x-AMI "SB02O"
#string STR_MISC_DEBUG_CONFIG_FORM_HELP #language eng "Options For SB DEBUG Configuration"

#string STR_IR_CONFIG_FORM              #language eng "SB IR Configuration"
#language x-AMI "SB02P"
#string STR_IR_CONFIG_FORM_HELP         #language eng "Options For IR"

#string STR_SD_CONFIG_FORM              #language eng "SB SD Configuration"
#language x-AMI "SB02Q"
#string STR_SD_CONFIG_FORM_HELP         #language eng "Options For SD"

#string STR_SATA_DEBUG_CONFIG_FORM      #language eng "SB SATA DEBUG Configuration"
#language x-AMI "SB02R"
#string STR_SATA_DEBUG_CONFIG_FORM_HELP #language eng "Options For SATA  DEBUG Configuration"

#string STR_FUSION_DEBUG_CONFIG_FORM    #language eng "SB FUSION DEBUG Configuration"
#language x-AMI "SB02S"
#string STR_FUSION_DEBUG_CONFIG_FORM_HELP   #language eng "Options For SB FUSION DEBUG Configuration"

#string STR_SPI_DEBUG_CONFIG_FORM       #language eng "SB SPI DEBUG Configuration"
#language x-AMI "SB02T"
#string STR_SPI_DEBUG_CONFIG_FORM_HELP  #language eng "Options For SB SPI DEBUG Configuration"

        // SATA PHY PLL
        //
#string STR_SATA_PHY_PLL_STRING         #language eng "SATA PHY PLL"
#language x-AMI "SB02W"
#string STR_SATA_PHY_PLL_HELP           #language eng "SATA PHY PLL Dynamic Shutdown"

        //
        // SATA_MaxGen2_CAP
        //
#string STR_SATA_MAXGEN2_CAP_STRING     #language eng "SATA MAXGEN2 CAP Option"
#language x-AMI "SB02X"
#string STR_SATA_MAXGEN2_CAP_HELP       #language eng "Set Sata Max Gen2 Mode"

        //
        // SATA_CLOCK_MODE
        //
#string STR_SATA_CLK_MODE_STRING        #language eng "SATA CLK Mode Option"
#language x-AMI "SB02Y"
#string STR_SATA_CLK_MODE_HELP          #language eng "SATA Reference Clock Selector And Divider"
#string STR_EXTERNAL_25MHZ_TEXT         #language eng "EXT 25MHz"
#string STR_INTERNAL_48MHZ_TEXT         #language eng "INT 48MHz"
#string STR_INTERNAL_100MHZ_TEXT        #language eng "INT 100MHz"
       //
        // SATA Target Support 8 Devices
        //
#string STR_SATA_TS_8DEVICES_STRING     #language eng "SATA Target Support 8 Devices"
#language x-AMI "SB02Z"
#string STR_SATA_TS_8DEVICES_HELP       #language eng "Indicates Whether SATA Target Support 8 Devices Function"

        //
        // Generic Mode
        //
#string STR_GENERIC_MODE_STRING         #language eng "Generic Mode"
#language x-AMI "SB030"
#string STR_GENERIC_MODE_HELP           #language eng "Sata Disable Generic Mode"

        //
        // SATA AHCI Enclosure
        //
#string STR_SATA_AHCI_ENCLOSURE_STRING  #language eng "SATA AHCI Enclosure"
#language x-AMI "SB031"
#string STR_SATA_AHCI_ENCLOSURE_HELP    #language eng "SATA AHCI Enclosure Management"

        //
        // SATA SGPIO 0
        //
#string STR_SATA_GPIO_0_STRING          #language eng "SATA SGPIO 0"
#language x-AMI "SB032"
#string STR_SATA_GPIO_0_HELP            #language eng "Enable/Disable SATA Serial General Purpose Input/Output (SGPIO) 0"

//STR_HELP
#string STR_SATA_ESP_HELP                       #language eng " SATA Port X Support ESATA Enabled/Disabled"
#string STR_SATA_POWER_HELP                     #language eng " SATA Port Power Enabled/Disabled"

        //
        // SD
        //
#string STR_SD_MODE_STRING                      #language eng "SD Mode"
#language x-AMI "SB036"
#string STR_SD_MODE_HELP                        #language eng "SD Mode Configuration"
#string STR_ADMA_TEXT                           #language eng "ADMA"
#string STR_DMA_TEXT                            #language eng "DMA"
#string STR_PIO_TEXT                            #language eng "PIO"

#string STR_SD_SDFORCE18_VERSION_STRING            #language eng "SdForce18 Enable"
#string STR_SD_SDFORCE18_VERSION_HELP           #language eng "Enable SdForce18"

#string STR_SD_DBGCONFIG_STRING            #language eng "SD Mode configuration"
#string STR_SD_DBGCONFIG_HELP                   #language eng "SD Mode"
#string STR_AMDA                    #language eng "AMDA"
#string STR_DMA                                 #language eng "DMA"
#string STR_PIO                            #language eng "PIO"

        //
        // AC/DC change message delivery
        //
#string STR_AC_DC_CHANGE_MESSAGE_DELIVERY_STRING        #language eng "AC/DC Change Message Delivery"
#language x-AMI "SB03E"
#string STR_AC_DC_CHANGE_MESSAGE_DELIVERY_HELP          #language eng "Send A Message To CPU To Indicate The Power Mode (AC VS Battery)"

        //
        // TimerTick tracking
        //
#string STR_TIMETICK_TRACKING_STRING                    #language eng "TimerTick Tracking"
#language x-AMI "SB03F"
#string STR_TIMETICK_TRACKING_HELP                      #language eng "Send A Message To CPU To Indicate The Latest Periodic Timer Interval"

        //
        // Clock interrupt tag
        //
#string STR_CLOCK_INTERRUPT_TAG_STRING                  #language eng "Clock Interrupt Tag"
#language x-AMI "SB03G"
#string STR_CLOCK_INTERRUPT_TAG_HELP                    #language eng "Mark The Periodic Timer Interrupt"

        //
        // EHCI traffic handling
        //
#string STR_EHCI_TRAFFIC_HANDLING_STRING                #language eng "EHCI Traffic Handling"
#language x-AMI "SB03H"
#string STR_EHCI_TRAFFIC_HANDLING_HELP                  #language eng "Cause CPU To Break Out From C State When USB EHCI Has Pending Traffic"

        //
        // Fusion message C Multi-core
        //
#string STR_FUSION_MESSAGE_C_MULTICORE_STRING           #language eng "Fusion Message C Multi-Core"
#language x-AMI "SB03I"
#string STR_FUSION_MESSAGE_C_MULTICORE_HELP             #language eng "Track Of CPU C State By Monitoring Each Core's C State Message"

        //
        // Fusion message C state
        //
#string STR_FUSION_MESSAGE_C_STATE_STRING               #language eng "Fusion Message C State"
#language x-AMI "SB03J"
#string STR_FUSION_MESSAGE_C_STATE_HELP                 #language eng "Enable The FCH C State Coordination Logic"

        //
        // SPI Read Mode
        //
#string STR_SPI_AUTO_MODE_STRING                        #language eng "SPI Auto Mode"
#language x-AMI "SB03K"
#string STR_SPI_READ_MODE_STRING                        #language eng "SPI Read Mode"
#language x-AMI "SB03L"
#string STR_QUAL_IO144_TEXT                             #language eng "Qual IO 1-4-4"
#string STR_QUAL_IO122_TEXT                             #language eng "Qual IO 1-2-2"
#string STR_QUAL_IO114_TEXT                             #language eng "Qual IO 1-1-4"
#string STR_QUAL_IO112_TEXT                             #language eng "Qual IO 1-1-2"
#string STR_FAST_READ_TEXT                              #language eng "Fast Read"
#string STR_NORMAL_TEXT                                 #language eng "Normal"
#string STR_MODE_000_TEXT                               #language eng "0-0-0"
#string STR_SPI_MODE_HELP                               #language eng "Change Dependent On Flash Part"

        //
        // SPI 100 Mode
        //
#string STR_SPI_100_MODE_STRING                         #language eng "SPI 100MHz Support"
#language x-AMI "SB03M"
#string STR_SPI_100_MODE_HELP                           #language eng "Change Dependent On Flash Part"

        //
        // SPI Fast Read Speed
        //
#string STR_SPI_FAST_READ_SPEED_STRING                  #language eng "SPI Fast Read Speed"
#language x-AMI "SB03N"

#string STR_100MHZ_TEXT                                 #language eng "100MHz"
#string STR_66MHZ_TEXT                                  #language eng "66MHz"
#string STR_33MHZ_TEXT                                  #language eng "33MHz"
#string STR_22MHZ_TEXT                                  #language eng "22MHz"
#string STR_165MHZ_TEXT                                 #language eng "16.5MHz"

        //
        // SPI Normal Speed
        //
#string STR_SPI_NORMAL_SPEED_STRING                     #language eng "SPI Normal Speed"
#language x-AMI "SB03O"

        //
        // SPI Burst Write
        //
#string STR_SPI_BURST_WRITE_STRING                      #language eng "SPI Burst Write"
#language x-AMI "SB03P"


        //
        // SB MTC1EENABLE
        //
#string STR_SB_MTC1E_PROMPT                             #language eng "SB C1E Support"
#language x-AMI "SB03Q"
#string STR_SBMTC1E_HELP                                #language eng "C1E Feature Need South Bridge And CPU Supported. This Item Open The C1E Of The SB Part."

#string STR_SDB_ENABLE_STRING                           #language eng "GPP Serial Debug Bus Enable"
#language x-AMI "SB03R"
#string STR_SDB_ENABLE_HELP                             #language eng "GPP Serial Debug Bus Enable"

//
// IMC Control
//
#string AMD_IMC_FAN_CONTROL_FORM                        #language eng "IMC Fan Control"
#language x-AMI "SB04D"
#string AMD_IMC_FAN_CONTROL_FORM_HELP                   #language eng "Integrated Micro Controller (IMC) Fan Control Operations"
#string STR_IMC_FAN_CONTROL                             #language eng "IMC Fan Control"
#language x-AMI "SB04E"
#string STR_IMC_FAN_CONTROL_HELP                        #language eng "OverWrite IMC With The EC Structure"

#string STR_CPU_TZ_CTRL1                                #language eng "CPU Thermal Zone 1"
#language x-AMI "SB04F"
#string STR_CPU_TZ_CTRL2                                #language eng "CPU Thermal Zone 2"
#language x-AMI "SB04G"
#string STR_CPU_TZ_HELP                                 #language eng "Warning! Please Follow Board Design To Select"

#string STR_CPU_HYSTERESIS                              #language eng "CPU Hysteresis"
#language x-AMI "SB04H"
#string STR_CPU_HYSTERESIS_HELP                         #language eng "CPU Hysteresis Information"
#string STR_CPU_PWM_STEP                                #language eng "CPU Fan PWM Stepping %"
#language x-AMI "SB04I"
#string STR_CPU_PWM_STEP_HELP                           #language eng "Fan PWM Stepping Rate In Unit Of PWM Level Percentage"
#string STR_CPU_PWM_RAMP_RATE                           #language eng "CPU Fan PWM Ramping Rate"
#language x-AMI "SB04J"
#string STR_CPU_PWM_RAMP_RATE_HELP                      #language eng "Fan PWM Ramping Rate In 5ms Unit"

#string STR_CPU_AC0                                     #language eng "CPU _AC0"
#language x-AMI "SB04K"
#string STR_CPU_AC0_HELP                                #language eng "Integrated The Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC1                                     #language eng "CPU _AC1"
#language x-AMI "SB04L"
#string STR_CPU_AC1_HELP                                #language eng "Integrated The 2nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC2                                     #language eng "CPU _AC2"
#language x-AMI "SB04M"
#string STR_CPU_AC2_HELP                                #language eng "Integrated The 3nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC3                                     #language eng "CPU _AC3"
#language x-AMI "SB04N"
#string STR_CPU_AC3_HELP                                #language eng "Integrated The 4nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC4                                     #language eng "CPU _AC4"
#language x-AMI "SB04O"
#string STR_CPU_AC4_HELP                                #language eng "Integrated The 5nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC5                                     #language eng "CPU _AC5"
#language x-AMI "SB04P"
#string STR_CPU_AC5_HELP                                #language eng "Integrated The 6nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC6                                     #language eng "CPU _AC6"
#language x-AMI "SB04Q"
#string STR_CPU_AC6_HELP                                #language eng "Integrated The 7nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_AC7                                     #language eng "CPU _AC7"
#language x-AMI "SB04R"
#string STR_CPU_AC7_HELP                                #language eng "Integrated The 8nd Highest Temperature Threshold In Degrees Of Celsius"
#string STR_CPU_CRT                                     #language eng "CPU _CRT"
#language x-AMI "SB04S"
#string STR_CPU_CRT_HELP                                #language eng "CPU _CRT"

#string STR_CPU_AL0                                     #language eng "CPU _AL0"
#language x-AMI "SB04T"
#string STR_CPU_AL0_HELP                                #language eng "AL0 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL1                                     #language eng "CPU _AL1"
#language x-AMI "SB04U"
#string STR_CPU_AL1_HELP                                #language eng "AL1 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL2                                     #language eng "CPU _AL2"
#language x-AMI "SB04V"
#string STR_CPU_AL2_HELP                                #language eng "AL2 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL3                                     #language eng "CPU _AL3"
#language x-AMI "SB04W"
#string STR_CPU_AL3_HELP                                #language eng "AL3 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL4                                     #language eng "CPU _AL4"
#language x-AMI "SB04X"
#string STR_CPU_AL4_HELP                                #language eng "AL4 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL5                                     #language eng "CPU _AL5"
#language x-AMI "SB04Y"
#string STR_CPU_AL5_HELP                                #language eng "AL5 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL6                                     #language eng "CPU _AL6"
#language x-AMI "SB04Z"
#string STR_CPU_AL6_HELP                                #language eng "AL6 PWM Level In Percentage (0 - 100%)"
#string STR_CPU_AL7                                     #language eng "CPU _AL7"
#language x-AMI "SB050"
#string STR_CPU_AL7_HELP                                #language eng "AL7 PWM Level In Percentage (0 - 100%)"

#string STR_HPET_MSIDIS_PROMPT                          #language eng "MsiDis in HPET"
#language x-AMI "SB051"
#string STR_HPET_MSIDIS_HELP                            #language eng "Expose MSI capability in HPET Capbility register"

#string STR_IMC_ENABLE                                  #language eng "IMC Enable"
#language x-AMI "SB056"
#string STR_IMC_ENABLE_HELP                             #language eng "IMC Enable"
// I2C
#string STR_I2C0_ENABLE_STRING                          #language eng "I2C 0 Enable"
#language x-AMI "SB052"
#string STR_I2C0_ENABLE_HELP                            #language eng "I2C 0 Enable"
#string STR_I2C1_ENABLE_STRING                          #language eng "I2C 1 Enable"
#language x-AMI "SB053"
#string STR_I2C1_ENABLE_HELP                            #language eng "I2C 1 Enable"
#string STR_I2C2_ENABLE_STRING                          #language eng "I2C 2 Enable"
#language x-AMI "SB054"
#string STR_I2C2_ENABLE_HELP                            #language eng "I2C 2 Enable"
#string STR_I2C3_ENABLE_STRING                          #language eng "I2C 3 Enable"
#language x-AMI "SB055"
#string STR_I2C3_ENABLE_HELP                            #language eng "I2C 3 Enable"
// Uart
#string STR_UART0_ENABLE_STRING                         #language eng "Uart 0 Enable"
#language x-AMI "SB056"
#string STR_UART0_ENABLE_HELP                           #language eng "Uart 0 Enable"
#string STR_UART1_ENABLE_STRING                         #language eng "Uart 1 Enable"
#language x-AMI "SB057"
#string STR_UART1_ENABLE_HELP                           #language eng "Uart 1 Enable"
// I2C FORM
#string STR_I2C_CONFIG_FORM                             #language eng "SB I2C Configuration"
#language x-AMI "SB058"
#string STR_I2C_CONFIG_FORM_HELP                        #language eng "Options For I2C Configuration"

// Uart FORM
#string STR_UART_CONFIG_FORM                            #language eng "SB UART Configuration"
#language x-AMI "SB059"
#string STR_UART_CONFIG_FORM_HELP                       #language eng "Options For UART Configuration"
#language x-AMI "SB060"

#string STR_XHCI0PORT_2_STRING                          #language eng "XHCI0 Port 2"
#language x-AMI "SB061"
#string STR_XHCI0PORT_2_HELP                            #language eng "XHCI0 Port 2"
#string STR_XHCI0PORT_3_STRING                          #language eng "XHCI0 Port 3"
#language x-AMI "SB062"
#string STR_XHCI0PORT_3_HELP                            #language eng "XHCI0 Port 3"
#string STR_SDV2_TEXT                                   #language eng "Ver2.0"
#language x-AMI "SB063"
#string STR_SDV3_TEXT                                   #language eng "Ver3.0"
#language x-AMI "SB064"
#string STR_SDV3SDR50_TEXT                              #language eng "V3_SDR50"
#language x-AMI "SB065"
#string STR_SDV3SDR104_TEXT                             #language eng "V3_SDR104"
#language x-AMI "SB066"
#string STR_SDV3DDR50_TEXT                              #language eng "V3_DDR50"
#language x-AMI "SB067"
#string STR_SDDUMP_TEXT                                 #language eng "SdDump"
#language x-AMI "SB068"
#string STR_AUTO_V2LOW_TEXT                             #language eng "Auto(Ver2.0+Low speed)"
#language x-AMI "SB069"


#string STR_GPIO_ACPI_ENABLE_PROMPT                    #language eng "GPIO Devices Support"
#language x-AMI "SB083"
#string STR_GPIO_ACPI_ENABLE_HELP                      #language eng "Enable/Disable GPIO ACPI Devices Support, disable it will disable i2C and uart interface device."
#language x-AMI "SB084"
#string STR_DEFAULT_TEXT                    #language    eng    "Default"
//#string <string name>                   #language eng ""
